// modules/cmd.help.js
module.exports = function (bot) {
  bot.onText(/^!команды$/i, async (msg) => {
    const chatId = msg.chat.id;

    const text = `
📖 *Список доступных команд:*

▫️ *описание* — ваше описание.  
В ответ на чужое сообщение возвращает описание того, кому вы отвечаете.  
▫️ *описание @тег* — описание человека по тегу.

✏️ *Изменение описания:*  
• \`+ник\` — меняет ваш ник.  
• \`+возраст\` — меняет ваш возраст.  
• \`+город\` — меняет ваш город.  
• \`+имя\` — меняет ваше имя (если заполнено неправильно).

💍 *Браки:*  
• \`!браки\` — список браков текущего чата.  
• \`!брак @тег\` — предложение вступления в брак.  
• \`!развод\` — расторжение отношений.

📜 *Клан:*  
• \`правила\` — правила клана.  
• \`!земляк\` — список сокланов в радиусе 400 км от вашего города.
    `;

    await bot.sendMessage(chatId, text, {
      parse_mode: "Markdown"
    });
  });
};
